## String data handling in SQL

In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:mysql@localhost

In [2]:
%%sql

use de_projects;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql

create table string (id int auto_increment primary key,
                    name varchar(50) not null,
                    email varchar(100) not null,
                    city varchar(50),
                    phone_num varchar(10) check (length(phone_num) = 10) );

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [5]:
%%sql

insert into string values (default, "laura john", "laura@gmail.com", "washington", '1234567890');
insert into string values (default, "daniel seetharam", "daniel@gmail.com", "bangalore", '8976543210');
insert into string values (default, "sam curren", "sam@gmail.com", "washington", '3214567890');
insert into string values (default, "ancy john", "ancy@gmail.com", "chennai", '5432167890');
insert into string values (default, "john doe", "john@gmail.com", "hyderabad", '7890654321');
insert into string values (default, "jessy adam", "jessy@gmail.com", "mumbai", '6754321890');
select * from string;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
6 rows affected.

[(1, 'laura john', 'laura@gmail.com', 'washington', '1234567890'),
 (2, 'daniel seetharam', 'daniel@gmail.com', 'bangalore', '8976543210'),
 (3, 'sam curren', 'sam@gmail.com', 'washington', '3214567890'),
 (4, 'ancy john', 'ancy@gmail.com', 'chennai', '5432167890'),
 (5, 'john doe', 'john@gmail.com', 'hyderabad', '7890654321'),
 (6, 'jessy adam', 'jessy@gmail.com', 'mumbai', '6754321890')]

### 1. Length function: Counts each character in the string including space

In [7]:
%%sql

select length(name) as name_length from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(10,), (16,), (10,), (9,), (8,), (10,)]

### 2. UPPER function and LOWER case functions

In [10]:
%%sql

select upper(name) as name, upper(city) as city, lower(email) as email, id, phone_num from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[('LAURA JOHN', 'WASHINGTON', 'laura@gmail.com', 1, '1234567890'),
 ('DANIEL SEETHARAM', 'BANGALORE', 'daniel@gmail.com', 2, '8976543210'),
 ('SAM CURREN', 'WASHINGTON', 'sam@gmail.com', 3, '3214567890'),
 ('ANCY JOHN', 'CHENNAI', 'ancy@gmail.com', 4, '5432167890'),
 ('JOHN DOE', 'HYDERABAD', 'john@gmail.com', 5, '7890654321'),
 ('JESSY ADAM', 'MUMBAI', 'jessy@gmail.com', 6, '6754321890')]

### 3. Concat function: returns with no space

In [12]:
%%sql

select id, name, city, email, concat(name, city) as name_city, phone_num from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura john', 'washington', 'laura@gmail.com', 'laura johnwashington', '1234567890'),
 (2, 'daniel seetharam', 'bangalore', 'daniel@gmail.com', 'daniel seetharambangalore', '8976543210'),
 (3, 'sam curren', 'washington', 'sam@gmail.com', 'sam currenwashington', '3214567890'),
 (4, 'ancy john', 'chennai', 'ancy@gmail.com', 'ancy johnchennai', '5432167890'),
 (5, 'john doe', 'hyderabad', 'john@gmail.com', 'john doehyderabad', '7890654321'),
 (6, 'jessy adam', 'mumbai', 'jessy@gmail.com', 'jessy adammumbai', '6754321890')]

### Concat function proper usage

In [13]:
%%sql

select id, name, city, email, phone_num, concat(name, " - ", city) as name_city from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura john', 'washington', 'laura@gmail.com', '1234567890', 'laura john - washington'),
 (2, 'daniel seetharam', 'bangalore', 'daniel@gmail.com', '8976543210', 'daniel seetharam - bangalore'),
 (3, 'sam curren', 'washington', 'sam@gmail.com', '3214567890', 'sam curren - washington'),
 (4, 'ancy john', 'chennai', 'ancy@gmail.com', '5432167890', 'ancy john - chennai'),
 (5, 'john doe', 'hyderabad', 'john@gmail.com', '7890654321', 'john doe - hyderabad'),
 (6, 'jessy adam', 'mumbai', 'jessy@gmail.com', '6754321890', 'jessy adam - mumbai')]

### 4. Extracting substring from a column

In [14]:
%%sql

select id, substring(name, 1, 5) as name, city from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura', 'washington'),
 (2, 'danie', 'bangalore'),
 (3, 'sam c', 'washington'),
 (4, 'ancy ', 'chennai'),
 (5, 'john ', 'hyderabad'),
 (6, 'jessy', 'mumbai')]

### 5. Trim function: To remove space from the string

In [15]:
%%sql

select id, trim(substring(name, 1, 6)) as name from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura'),
 (2, 'daniel'),
 (3, 'sam cu'),
 (4, 'ancy j'),
 (5, 'john d'),
 (6, 'jessy')]

### 6. Lpad function: It displays as * or other specified character for encryption purpose

In [23]:
%%sql

select id, name, email, city, lpad(cast(phone_num as char), 10, "*") as phone_num from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura john', 'laura@gmail.com', 'washington', '1234567890'),
 (2, 'daniel seetharam', 'daniel@gmail.com', 'bangalore', '8976543210'),
 (3, 'sam curren', 'sam@gmail.com', 'washington', '3214567890'),
 (4, 'ancy john', 'ancy@gmail.com', 'chennai', '5432167890'),
 (5, 'john doe', 'john@gmail.com', 'hyderabad', '7890654321'),
 (6, 'jessy adam', 'jessy@gmail.com', 'mumbai', '6754321890')]

In [29]:
%%sql

select id, name, LPAD(email, 5, '*') as lpadding from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura john', 'laura'),
 (2, 'daniel seetharam', 'danie'),
 (3, 'sam curren', 'sam@g'),
 (4, 'ancy john', 'ancy@'),
 (5, 'john doe', 'john@'),
 (6, 'jessy adam', 'jessy')]

### 7. Replace function: To replace any character with the specified character in the string

In [30]:
%%sql

select id, replace(name, " ", "-") as name, email from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura-john', 'laura@gmail.com'),
 (2, 'daniel-seetharam', 'daniel@gmail.com'),
 (3, 'sam-curren', 'sam@gmail.com'),
 (4, 'ancy-john', 'ancy@gmail.com'),
 (5, 'john-doe', 'john@gmail.com'),
 (6, 'jessy-adam', 'jessy@gmail.com')]

### 8. instring function: it finds the location of specific character in the string

In [32]:
%%sql

select id, name, instr(name, "a") as instring_col, email from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura john', 2, 'laura@gmail.com'),
 (2, 'daniel seetharam', 2, 'daniel@gmail.com'),
 (3, 'sam curren', 2, 'sam@gmail.com'),
 (4, 'ancy john', 1, 'ancy@gmail.com'),
 (5, 'john doe', 0, 'john@gmail.com'),
 (6, 'jessy adam', 7, 'jessy@gmail.com')]

### 9. Left function: extracts the number of specific left characters from the string

In [33]:
%%sql

select id, name, left(name, 5) as starting_name, email from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura john', 'laura', 'laura@gmail.com'),
 (2, 'daniel seetharam', 'danie', 'daniel@gmail.com'),
 (3, 'sam curren', 'sam c', 'sam@gmail.com'),
 (4, 'ancy john', 'ancy ', 'ancy@gmail.com'),
 (5, 'john doe', 'john ', 'john@gmail.com'),
 (6, 'jessy adam', 'jessy', 'jessy@gmail.com')]

### 10. right function: It extracts right part og the string from a string

In [34]:
%%sql

select id, name, right(email, 9), email from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura john', 'gmail.com', 'laura@gmail.com'),
 (2, 'daniel seetharam', 'gmail.com', 'daniel@gmail.com'),
 (3, 'sam curren', 'gmail.com', 'sam@gmail.com'),
 (4, 'ancy john', 'gmail.com', 'ancy@gmail.com'),
 (5, 'john doe', 'gmail.com', 'john@gmail.com'),
 (6, 'jessy adam', 'gmail.com', 'jessy@gmail.com')]

### 11. reverse function: To make a string reverse

In [36]:
%%sql

select id, name, reverse(name) as reversed_name, email from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura john', 'nhoj arual', 'laura@gmail.com'),
 (2, 'daniel seetharam', 'marahtees leinad', 'daniel@gmail.com'),
 (3, 'sam curren', 'nerruc mas', 'sam@gmail.com'),
 (4, 'ancy john', 'nhoj ycna', 'ancy@gmail.com'),
 (5, 'john doe', 'eod nhoj', 'john@gmail.com'),
 (6, 'jessy adam', 'mada yssej', 'jessy@gmail.com')]

### 12. format function: To format currency or other datatypes

In [37]:
%%sql

alter table string add column amount decimal(10, 2);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [38]:
%%sql

update string set amount = 100000 where id = 1;
update string set amount = 200000 where id = 2;
update string set amount = 300000 where id = 3;
update string set amount = 400000 where id = 4;
update string set amount = 500000 where id = 5;
update string set amount = 60000000 where id = 6;
select * from string;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
6 rows affected.

[(1, 'laura john', 'laura@gmail.com', 'washington', '1234567890', Decimal('100000.00')),
 (2, 'daniel seetharam', 'daniel@gmail.com', 'bangalore', '8976543210', Decimal('200000.00')),
 (3, 'sam curren', 'sam@gmail.com', 'washington', '3214567890', Decimal('300000.00')),
 (4, 'ancy john', 'ancy@gmail.com', 'chennai', '5432167890', Decimal('400000.00')),
 (5, 'john doe', 'john@gmail.com', 'hyderabad', '7890654321', Decimal('500000.00')),
 (6, 'jessy adam', 'jessy@gmail.com', 'mumbai', '6754321890', Decimal('60000000.00'))]

In [39]:
%%sql

select id, name, email, format(amount, 2) from string;

 * mysql+mysqlconnector://root:***@localhost
6 rows affected.

[(1, 'laura john', 'laura@gmail.com', '100,000.00'),
 (2, 'daniel seetharam', 'daniel@gmail.com', '200,000.00'),
 (3, 'sam curren', 'sam@gmail.com', '300,000.00'),
 (4, 'ancy john', 'ancy@gmail.com', '400,000.00'),
 (5, 'john doe', 'john@gmail.com', '500,000.00'),
 (6, 'jessy adam', 'jessy@gmail.com', '60,000,000.00')]